package Lesson_4;

public class Task_4 {
    public static void main(String[] args) {
    /*
        Задание 4:

        Написать программу, которая выводит арифметическую или геометрическую прогрессию для N чисел.

     */


    System.out.println("Программа выводит арифметическую прогрессию");
    System.out.println("=====================================================");
    System.out.println();

    for (int i = 1; i <= 10; i++)
            System.out.print(i + " ");
        System.out.println();

    }
}
